/****************************************************************/
/*  <oburg.c> 1 августа 94   последнее изменение:  3 февраля 94 */
/*  (С) Ю.Погудин, xTech Ltd., 1994    Новосибирск, т.35-11-53  */
/****************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#define BFSIZE 256
static FILE *infp = NULL;       /* Файл входного текста         */
static FILE *outfp = NULL;      /* Файл выходного текста        */
static char inbuf[BFSIZE];             /* Буфер входного текста        */
/****************************************************************/
void main(int argc, char *argv[])
{
int i, j;                       /* вспомогательные счетчики     */
char b[BFSIZE];                 /* буфер для модификации имен   */
char bb[BFSIZE];                /* буфер для модификации имен   */
char *a;                        /* указ. на вх.строку параметра */
int c;                          /* буферная литера вх.текста    */
/****************************************************************/
/* Извлечение опций и имен файлов из командной строки MS-DOS    */
/****************************************************************/
	     /* файл входного текста              */
	     for(a=argv[1],j=0;*a!=0 && *a!='.';++a) b[j++]=*a;
	     if(*a==0)
	       b[j++]='.',b[j++]='l',b[j++]='s',b[j++]='t',b[j]=0;
             else { for(;*a!=0;++a) b[j++]=*a; b[j]=0; }
             if ((infp = fopen(b, "r")) == NULL)
             {
		printf("%s: не открывается для чтения файл `%s'\n",
                        argv[0],b);
                exit(1);
             }
	     b[j-1]='v'; b[j-2]='c';
	     if ((outfp = fopen(b, "w")) == NULL)
             {
	       printf("%s: не открывается для записи файл `%s'\n",
                       argv[0], b);
               exit(1);
             }

    for(i=0; fgets(inbuf, sizeof inbuf, infp) != NULL; ++i)
    {
      if(inbuf[25]=='-') exit(1);
      if(i>4) fputs(inbuf+25, outfp);
    }
}

